src/cf/src/InformationRegisters/УчетОборудованияРабочихМест/УчетОборудованияРабочихМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетОборудованияРабочихМест</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Catalogs/РабочиеМеста/РабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМеста</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШаблонУдаленногоДоступа</name>
    <type>
      <types>CatalogRef.ШаблоныУдаленногоДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРабочихИнструментов</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриобретения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоХарактеристика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/CommonModules/УправлениеИТАктивами/Module.bsl
#Область ПрограммныйИнтерфейс

// Данные об активах в регистре УчетОборудованияРабочихМест
//
// Параметры:
//  ДанныеДляПоиска	 - Структура - содержит свойства:
//		* Организация - СправочникСсылка.Организации - может быть не заполнено
//		* РабочееМесто - СправочникСсылка.РабочиеМеста - может быть не заполнено
//		* Номенклатура - СправочникСсылка.Номенклатура - может быть не заполнено
//		* ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры - может быть не заполнено
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//		* Организация - СправочникСсылка.Организации
//		* РабочееМесто - СправочникСсылка.РабочиеМеста
//		* Номенклатура - СправочникСсылка.Номенклатура
//		* Количество - Число
//
Функция ДанныеОбАктивах(ДанныеДляПоиска) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетОборудованияРабочихМест.Организация,
	               |	УчетОборудованияРабочихМест.РабочееМесто,
	               |	УчетОборудованияРабочихМест.Номенклатура,
	               |	УчетОборудованияРабочихМест.Количество,
	               |	УчетОборудованияРабочихМест.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
	               |ИЗ
	               |	РегистрСведений.УчетОборудованияРабочихМест КАК УчетОборудованияРабочихМест
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ЕстьОрганизация
	               |				ТОГДА УчетОборудованияРабочихМест.Организация = &Организация
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ЕстьРабочееМесто
	               |				ТОГДА УчетОборудованияРабочихМест.РабочееМесто = &РабочееМесто
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ЕстьНоменклатура
	               |				ТОГДА УчетОборудованияРабочихМест.Номенклатура = &Номенклатура
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ЕстьВидНоменклатуры
	               |				ТОГДА УчетОборудованияРабочихМест.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	
	Запрос.УстановитьПараметр("ЕстьОрганизация", ДанныеДляПоиска.Свойство("Организация"));		
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.ПустаяСсылка());		
	Если ДанныеДляПоиска.Свойство("Организация") Тогда
		Запрос.УстановитьПараметр("Организация", ДанныеДляПоиска.Организация);
	КонецЕсли;
	Запрос.УстановитьПараметр("ЕстьРабочееМесто", ДанныеДляПоиска.Свойство("РабочееМесто"));				
	Запрос.УстановитьПараметр("РабочееМесто", Справочники.РабочиеМеста.ПустаяСсылка());
	Если ДанныеДляПоиска.Свойство("РабочееМесто") Тогда
		Запрос.УстановитьПараметр("РабочееМесто", ДанныеДляПоиска.РабочееМесто);
	КонецЕсли;
	Запрос.УстановитьПараметр("ЕстьНоменклатура", ДанныеДляПоиска.Свойство("Номенклатура"));				
	Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	Если ДанныеДляПоиска.Свойство("Номенклатура") Тогда
		Запрос.УстановитьПараметр("Номенклатура", ДанныеДляПоиска.Номенклатура);
	КонецЕсли;
	Запрос.УстановитьПараметр("ЕстьВидНоменклатуры", ДанныеДляПоиска.Свойство("ВидНоменклатуры"));				
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВидыНоменклатуры.ПустаяСсылка());
	Если ДанныеДляПоиска.Свойство("ВидНоменклатуры") Тогда
		Запрос.УстановитьПараметр("ВидНоменклатуры", ДанныеДляПоиска.ВидНоменклатуры);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СтруктураНайденныхДанных = Новый Структура();
	СтруктураНайденныхДанных.Вставить("Организация" ,Справочники.Организации.ПустаяСсылка());	
	СтруктураНайденныхДанных.Вставить("РабочееМесто",Справочники.РабочиеМеста.ПустаяСсылка());	
	СтруктураНайденныхДанных.Вставить("Номенклатура",Справочники.Номенклатура.ПустаяСсылка());	
	СтруктураНайденныхДанных.Вставить("Количество",0);	
	
	Если Выборка.Следующий() Тогда
	
		 СтруктураНайденныхДанных.Организация  = Выборка.Организация;
		 СтруктураНайденныхДанных.РабочееМесто = Выборка.РабочееМесто;
		 СтруктураНайденныхДанных.Номенклатура = Выборка.Номенклатура;
		 
		 СтруктураНайденныхДанных.Количество   = Выборка.Количество;
		 
	КонецЕсли;
	
    Возврат СтруктураНайденныхДанных;
	
КонецФункции // ПолучитьДанныеОбАктивах()

#КонецОбласти
